# ------------------------------- The Start --------------------------------------
# -------------------
# -- Lists methods --
# -------------------

# clear()  # يحذف كل العناصر من القائمة

a =  [1, 2, 3, 4, 5]
a.clear()
print(a)  # []

# copy()  # ينشئ نسخة من القائمة

b = [10, 20, 30, 40, 50]
c = b.copy()

b.append(5) # يضيف عنصر الى القائمة b فقط

print(b) # main list
print(c)  # copied list

# count()  # يحسب عدد مرات تكرار عنصر معين في القائمة

d = [1, 2, 3, 1, 4, 5, 1, 1, 6, 1]
print(d.count(1))  # 5

# index()  # يعيد موقع اول عنصر معين في القائمة

e = ["A", "B", "C", "D", "E", "C", "F"]
print(e.index("C"))  # 2
print(e.index("E"))  # 4

# insert()  # يضيف عنصر في موقع معين في القائمة

f = [1, 2, 3, 4, 5]
f.insert(2, 100)  # يضيف 100 في الموقع 2
print(f)  # [1, 2, 100, 3, 4, 5]

# pop()  # يحذف العنصر في الموقع المعين ويعيده

g = [10, 20, 30, 40, 50]
removed_item = g.pop(3)  # يحذف العنصر في الموقع 3
print(g)  # [10, 20, 30, 50]
print(removed_item)  # 40
#------------------------------- The End ----------------------------------------