# ------------------------------- The Start --------------------------------------
#----------------------------
#-- Set methods --
#-----------------

# clear() # يحذف جميع عناصر المجموعه
mySetA = {"Habib", "Eldabea", 100}
mySetA.clear()
print(mySetA)  # set()  المجموعه اصبحت فارغه

#union() # دمج مجموعتين مع حذف العناصر المكرره

a = {1, 2, 3}
b = {"A", "B", "C"}
print(a | b)  # {1, 2, 3, 'A', 'B', 'C'}  دمج المجموعتين مع حذف العناصر المكرره
print(a.union(b))  # {1, 2, 3, 'A', 'B', 'C'}  دمج المجموعتين مع حذف العناصر المكرره

# add() # يضيف عنصر جديد الى المجموعه

c = {1, 2, 3}
c.add(4)
c.add("Habib")
print(c)  # {1, 2, 3, 4, 'Habib'}  اضافه عناصر جديده الى المجموعه

# copy() # نسخ المجموعه الى مجموعه جديده

d = {1, 2, 3}
e = d.copy()

d.add(4)

print(d) # {1, 2, 3, 4}  المجموعه الاصليه
print(e) # {1, 2, 3}  المجموعه المنسوخه

# remove() # يحذف عنصر معين من المجموعه

e = {1, 2, 3}
e.remove(2)
print(e)  # {1, 3}  حذف عنصر معين من المجموعه

# discard() # يحذف عنصر معين من المجموعه بدون ظهور خطأ اذا لم يكن العنصر موجود

f = {1, 2, 3}
f.discard(2)
f.discard(5)  # لا يظهر خطأ لان العنصر 5 غير موجود
print(f)  # {1, 3}  حذف عنصر معين من المجموعه

# pop() # يحذف عنصر عشوائي من المجموعه ويرجعه

g = {"A" ,True, 1 , 2}
print(g.pop())  # حذف عنصر عشوائي من المجموعه
print(g)  # المجموعه بعد حذف العنصر العشوائي

# update() # يضيف عناصر من مجموعه اخرى الى المجموعه الاصليه مع حذف العناصر المكرره

h = {1, 2, 3}
i = {"A", "B", 2, 3}
h.update(i)
h.update(["hello", "world"]) # يمكن اضافه ليست ايضا
print(h)  # {1, 2, 3, 'A', 'B'}  اضافه عناصر من المجموعه i الى المجموعه h مع حذف العناصر المكرره

# difference() # يعيد مجموعه تحتوي على العناصر التي في المجموعه الاولى وليست في المجموعه الثانيه

j = {1, 2, 3, 4}
k = {3, 4, 5, 6}
print(j)  # {1, 2, 3, 4}
print(j.difference(k))  # {1, 2}  العناصر التي في j وليست في k
print(k.difference(j))  # {5, 6}  العناصر التي في k وليست في j

# difference_update() # يحذف من المجموعه الاولى العناصر التي في المجموعه الثانيه

l = {1, 2, 3, 4}
m = {3, 4, 5, 6}
l.difference_update(m)
print(l)  # {1, 2}  حذف من l العناصر التي في m

# intersection() # يعيد مجموعه تحتوي على العناصر المشتركه بين المجموعتين

n = {1, 2, 3, 4 ,"H"}
o = {3, 4, 5, 6 ,"H"}
print(n.intersection(o))  # {3, 4, 'H'}  العناصر المشتركه بين n و o

# intersection_update() # يحتفظ في المجموعه الاولى بالعناصر المشتركه بين المجموعتين

p = {1, 2, 3, 4 ,"H"}
q = {3, 4, 5, 6 ,"H"}
p.intersection_update(q)
print(p)  # {3, 4, 'H'}  احتفظ في p بالعناصر المشتركه بين p و q

# symmetric_difference() # يعيد مجموعه تحتوي على العناصر التي ليست مشتركه بين المجموعتين

r = {1, 2, 3, 4 ,"H"}
s = {3, 4, 5, 6 ,"H"}
print(r.symmetric_difference(s))  # {1, 2, 5, 6}  العناصر التي ليست مشتركه بين r و s

# issuperset() # يتحقق اذا كانت المجموعه الاولى تحتوي على جميع عناصر المجموعه الثانيه

t = {1, 2, 3, 4, 5}
u = {2, 3, 4}
print(t.issuperset(u))  # True  t تحتوي على جميع عناصر u

# issubset() # يتحقق اذا كانت المجموعه الاولى عناصرها كلها في المجموعه الثانيه

v = {2, 3, 4}
w = {1, 2, 3, 4, 5}
print(v.issubset(w))  # True  v عناصرها كلها في w
 
 # isdisjoint() # يتحقق اذا كانت المجموعتين لا تحتوي على عناصر مشتركه

x = {1, 2, 3}
y = {4, 5, 6}
print(x.isdisjoint(y))  # True  x و y لا تحتوي على عناصر مشتركه
